[{"quote": "Functions delay binding; data structures induce binding. Moral: Structure data late in the programming process.",
  "author": "Alan Perlis"},
 {"quote": "Syntactic sugar causes cancer of the semicolon.", "author": "Alan Perlis"},
 {"quote": "Every program is a part of some other program and rarely fits.", "author": "Alan Perlis"},
 {"quote":  "Symmetry is a complexity-reducing concept (co-routines include subroutines); seek it everywhere.", "author": "Alan Perlis"},
 {"quote": "It is easier to write an incorrect program than understand a correct one.", "author": "Alan Perlis"},
 {"quote": "A programming language is low level when its programs require attention to the irrelevant.", "author": "Alan Perlis"},
 {"quote": "It is better to have 100 functions operate on one data structure than 10 functions on 10 data structures.", "author": "Alan Perlis"},
 {"quote": "If you have a procedure with ten parameters, you probably missed some.", "author": "Alan Perlis"},
 {"quote": "Recursion is the root of computation since it trades description for time.", "author": "Alan Perlis"},
 {"quote": "Everything should be built top-down, except the first time.", "author": "Alan Perlis"},
 {"quote": "Every program has (at least) two purposes: the one for which it was written, and another for which it wasn't.", "author": "Alan Perlis"},
 {"quote": "If a listener nods his head when you're explaining your program, wake him up.", "author": "Alan Perlis"},
 {"quote": "A program without a loop and a structured variable isn't worth writing.", "author": "Alan Perlis"},
 {"quote": "A language that doesn't affect the way you think about programming, is not worth knowing.", "author": "Alan Perlis"},
 {"quote": "Wherever there is modularity there is the potential for misunderstanding: Hiding information implies a need to check communication.", "author": "Alan Perlis"},
 {"quote": "Optimization hinders evolution.", "author": "Alan Perlis"},
 {"quote": "To understand a program you must become both the machine and the program.", "author": "Alan Perlis"},
 {"quote": "Perhaps if we wrote programs from childhood on, as adults we'd be able to read them.", "author": "Alan Perlis"},
 {"quote": "In programming, everything we do is a special case of something more general -- and often we know it too quickly.", "author": "Alan Perlis"},
 {"quote": "Simplicity does not precede complexity, but follows it.", "author": "Alan Perlis"},
 {"quote": "Programmers are not to be measured by their ingenuity and their logic but by the completeness of their case analysis.", "author": "Alan Perlis"},
 {"quote": "Some programming languages manage to absorb change, but withstand progress.", "author": "Alan Perlis"}]

